{
  "posts": [
    {
      "id": 1,
      "title": "Post numer 1",
      "text": "But I must explain to you how all this mistaken idea of denouncing pleasure and praising pain was born and I will give you a complete account of the system, and expound the actual teachings of the great explorer of the truth, the master-builder of human happiness. No one rejects, dislikes, or avoids pleasure itself, because it is pleasure, but because those who do not know how to pursue pleasure rationally encounter consequences that are extremely painful. ",
      "like": false
    },
    {
      "id": 2,
      "title": "Post numer 2",
      "text": "On the other hand, we denounce with righteous indignation and dislike men who are so beguiled and demoralized by the charms of pleasure of the moment, so blinded by desire, that they cannot foresee the pain and trouble that are bound to ensue; and equal blame belongs to those who fail in their duty through weakness of will, which is the same as saying through shrinking from toil and pain. These cases are perfectly simple and easy to distinguish. In a free hour, when our power of choice is untrammelled and when nothing prevents our being able to do what we like best, every pleasure is to be welcomed and every pain avoided. But in certain circumstances and owing to the claims of duty or the obligations of business it will frequently occur that pleasures have to be repudiated and annoyances accepted. The wise man therefore always holds in these matters to this principle of selection: he rejects pleasures to secure other greater pleasures, or else he endures pains to avoid worse pains.",
      "like": false
    },
    {
      "title": "Trzeci na podium",
      "text": "Najwięcej razy w historii Formuły 1 stawał na podium Michael Schumacher – w 155 wyścigach. Drugi jest Lewis Hamilton (143 razy na podium), a trzeci Sebastian Vettel (111 razy na podium). Rekordzistą, jeśli chodzi o najdłuższy okres pomiędzy pierwszym a ostatnim pobytem na podium jest Michael Schumacher. Pomiędzy pierwszym jego podium, w Grand Prix Meksyku 1992, a ostatnim, w Grand Prix Europy 2012, minęło 20 lat, 3 miesiące i 2 dni. Najmłodszym zdobywcą podium, a zarazem zwycięzcą jest Sebastian Vettel, kiedy to wygrywając Grand Prix Włoch 2008 miał 21 lat i 73 dni. Najstarszym zaś zdobywcą podium i najstarszym zwycięzcą jest Luigi Fagioli, ponieważ wygrał Grand Prix Francji 1951, mając 53 lata i 22 dni.",
      "like": false,
      "id": 3
    },
    {
      "title": "A imię jego, Cztery.",
      "text": "4 (cztery) – liczba naturalna następująca po 3 i poprzedzająca 5. 4 jest też cyfrą wykorzystywaną do zapisu liczb w różnych systemach, np. w ósemkowym, dziesiętnym i szesnastkowym systemie liczbowym. 4. dniem w roku jest 4 stycznia, a 4. miesiącem w roku jest kwiecień. Cyfra „4” – oznacza bezpieczeństwo, rzetelną pracę i mocne fundamenty. To także samokontrola, lojalność, sumienność, rzeczywistość i realne wartości, stabilność i zdolność. Postęp, zarządzanie, sprawiedliwość, powaga, dyscyplina, porządek, konsekwencja, konstruktywność, niezawodność i przekonanie. Cyfra ta wiąże się z naszą pasją. Zachęca do jeszcze pilniejszej pracy, aby osiągnąć swoje cele.",
      "like": false,
      "id": 4
    },
    {
      "title": "Pięcioro dzieci i „coś”",
      "text": "Zwyczajne dzieci – Cyryl, Robert, Antea, Janeczka i Baranek, czyli ich najmłodszy brat, który nazywa się tak, bo kiedy pierwszy raz się odezwał, powiedział „mee!” – przeżywają niezwyczajne przygody za sprawą magicznych osób i przedmiotów. Dzieci mogą podróżować po całym świecie, a także do przyszłości i przeszłości. Zawsze jednak najważniejsze są dla nich przyjaźń, dobro rodziny, wzajemna lojalność.",
      "like": false,
      "id": 5
    }
  ]
}